MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG100/mcu.h
extern volatile __SBT13REG0bits_t SBT13REG0bits __asm__ ("SBT13REG0") __attribute__((section("sfrs"), address(0xBF8FB440)));
#define SBT13RD0 SBT13RD0
extern volatile uint32_t   SBT13RD0 __attribute__((section("sfrs"), address(0xBF8FB450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13RD0bits_t;
extern volatile __SBT13RD0bits_t SBT13RD0bits __asm__ ("SBT13RD0") __attribute__((section("sfrs"), address(0xBF8FB450)));
#define SBT13WR0 SBT13WR0
extern volatile uint32_t   SBT13WR0 __attribute__((section("sfrs"), address(0xBF8FB458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT13WR0bits_t;
extern volatile __SBT13WR0bits_t SBT13WR0bits __asm__ ("SBT13WR0") __attribute__((section("sfrs"), address(0xBF8FB458)));
#define USBIE0CSR0 USBIE0CSR0
extern volatile uint32_t   USBIE0CSR0 __attribute__((section("sfrs"), address(0xBF8E3010)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t :5;
    uint32_t RXRDY:1;
    uint32_t TXRDY:1;
    uint32_t STALLED:1;
    uint32_t SETUP:1;
    uint32_t ERROR:1;
    uint32_t REQPKT:1;
    uint32_t STATUS:1;
    uint32_t NAKTO:1;
    uint32_t FLUSH:1;
    uint32_t DT:1;
    uint32_t DTWE:1;
  };
  struct {
    uint32_t :19;
    uint32_t DATAEND:1;
    uint32_t SETEND:1;
    uint32_t STALL:1;
    uint32_t RXRDYC:1;
    uint32_t SETENDC:1;
  };
} __USBIE0CSR0bits_t;
extern volatile __USBIE0CSR0bits_t USBIE0CSR0bits __asm__ ("USBIE0CSR0") __attribute__((section("sfrs"), address(0xBF8E3010)));
#define USBIENCSR0 USBIENCSR0
extern volatile uint32_t   USBIENCSR0 __attribute__((section("sfrs"), address(0xBF8E3010)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBIENCSR0bits_t;
extern volatile __USBIENCSR0bits_t USBIENCSR0bits __asm__ ("USBIENCSR0") __attribute__((section("sfrs"), address(0xBF8E3010)));
#define USBIE0CSR2 USBIE0CSR2
extern volatile uint32_t   USBIE0CSR2 __attribute__((section("sfrs"), address(0xBF8E3018)));
typedef struct {
  uint32_t RXCNT:7;
  uint32_t :15;
  uint32_t SPEED:2;
  uint32_t NAKLIM:4;
} __USBIE0CSR2bits_t;
extern volatile __USBIE0CSR2bits_t USBIE0CSR2bits __asm__ ("USBIE0CSR2") __attribute__((section("sfrs"), address(0xBF8E3018)));
#define USBIENCSR2 USBIENCSR2
extern volatile uint32_t   USBIENCSR2 __attribute__((section("sfrs"), address(0xBF8E3018)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBIENCSR2bits_t;
extern volatile __USBIENCSR2bits_t USBIENCSR2bits __asm__ ("USBIENCSR2") __attribute__((section("sfrs"), address(0xBF8E3018)));
#define USBIE0CSR3 USBIE0CSR3
extern volatile uint32_t   USBIE0CSR3 __attribute__((section("sfrs"), address(0xBF8E301C)));
typedef struct {
  uint32_t :24;
  uint32_t UTMIDWID:1;
  uint32_t SOFTCONE:1;
  uint32_t DYNFIFOS:1;
  uint32_t HBTXEN:1;
  uint32_t HBRXEN:1;
  uint32_t BIGEND:1;
  uint32_t MPTXEN:1;
  uint32_t MPRXEN:1;
} __USBIE0CSR3bits_t;
extern volatile __USBIE0CSR3bits_t USBIE0CSR3bits __asm__ ("USBIE0CSR3") __attribute__((section("sfrs"), address(0xBF8E301C)));
#define USBIENCSR3 USBIENCSR3
extern volatile uint32_t   USBIENCSR3 __attribute__((section("sfrs"), address(0xBF8E301C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBIENCSR3bits_t;
extern volatile __USBIENCSR3bits_t USBIENCSR3bits __asm__ ("USBIENCSR3") __attribute__((section("sfrs"), address(0xBF8E301C)));
#define DEVCFG3 DEVCFG3
extern volatile uint32_t   DEVCFG3 __attribute__((section("sfrs"), address(0xBFC0FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs"), address(0xBFC0FFC0)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC0FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :11;
    uint32_t UPLLFSEL:1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC0FFC4)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC0FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC0FFC8)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC0FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t :15;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs"), address(0xBFC0FFCC)));
#define DEVCP3 DEVCP3
extern volatile uint32_t   DEVCP3 __attribute__((section("sfrs"), address(0xBFC0FFD0)));
#define DEVCP2 DEVCP2
extern volatile uint32_t   DEVCP2 __attribute__((section("sfrs"), address(0xBFC0FFD4)));
#define DEVCP1 DEVCP1
extern volatile uint32_t   DEVCP1 __attribute__((section("sfrs"), address(0xBFC0FFD8)));
#define DEVCP0 DEVCP0
extern volatile uint32_t   DEVCP0 __attribute__((section("sfrs"), address(0xBFC0FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCP0bits_t;
extern volatile __DEVCP0bits_t DEVCP0bits __asm__ ("DEVCP0") __attribute__((section("sfrs"), address(0xBFC0FFDC)));
#define DEVSIGN3 DEVSIGN3
extern volatile uint32_t   DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC0FFE0)));
#define DEVSIGN2 DEVSIGN2
extern volatile uint32_t   DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC0FFE4)));
#define DEVSIGN1 DEVSIGN1
extern volatile uint32_t   DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC0FFE8)));
#define DEVSIGN0 DEVSIGN0
extern volatile uint32_t   DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC0FFEC)));
#define SEQ3 SEQ3
extern volatile uint32_t   SEQ3 __attribute__((section("sfrs"), address(0xBFC0FFF0)));
#define SEQ2 SEQ2
extern volatile uint32_t   SEQ2 __attribute__((section("sfrs"), address(0xBFC0FFF4)));
#define SEQ1 SEQ1
extern volatile uint32_t   SEQ1 __attribute__((section("sfrs"), address(0xBFC0FFF8)));
#define SEQ0 SEQ0
extern volatile uint32_t   SEQ0 __attribute__((section("sfrs"), address(0xBFC0FFFC)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __SEQ0bits_t;
extern volatile __SEQ0bits_t SEQ0bits __asm__ ("SEQ0") __attribute__((section("sfrs"), address(0xBFC0FFFC)));
#define DEVADC1 DEVADC1
extern volatile uint32_t   DEVADC1 __attribute__((section("sfrs"), address(0xBFC54000)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC1bits_t;
extern volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs"), address(0xBFC54000)));
#define DEVADC2 DEVADC2
extern volatile uint32_t   DEVADC2 __attribute__((section("sfrs"), address(0xBFC54004)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC2bits_t;
extern volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs"), address(0xBFC54004)));
#define DEVADC3 DEVADC3
extern volatile uint32_t   DEVADC3 __attribute__((section("sfrs"), address(0xBFC54008)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC3bits_t;
extern volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs"), address(0xBFC54008)));
#define DEVADC4 DEVADC4
extern volatile uint32_t   DEVADC4 __attribute__((section("sfrs"), address(0xBFC5400C)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC4bits_t;
extern volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs"), address(0xBFC5400C)));
#define DEVADC5 DEVADC5
extern volatile uint32_t   DEVADC5 __attribute__((section("sfrs"), address(0xBFC54010)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC5bits_t;
extern volatile __DEVADC5bits_t DEVADC5bits __asm__ ("DEVADC5") __attribute__((section("sfrs"), address(0xBFC54010)));
#define DEVSN0 DEVSN0
extern volatile uint32_t   DEVSN0 __attribute__((section("sfrs"), address(0xBFC54020)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN0bits_t;
